bench/async-kafka/async-run6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/patient-create.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * patients: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 599 complete and 0 interrupted iterations
patients   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 1251 complete and 0 interrupted iterations
patients   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 2028 complete and 0 interrupted iterations
patients   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 2602 complete and 0 interrupted iterations
patients   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 3271 complete and 0 interrupted iterations
patients   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 3680 complete and 0 interrupted iterations
patients   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 3820 complete and 0 interrupted iterations
patients   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 4140 complete and 0 interrupted iterations
patients   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 4691 complete and 0 interrupted iterations
patients   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 5403 complete and 0 interrupted iterations
patients   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 6038 complete and 0 interrupted iterations
patients   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 6152 complete and 0 interrupted iterations
patients   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 6610 complete and 0 interrupted iterations
patients   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 7041 complete and 0 interrupted iterations
patients   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 7509 complete and 0 interrupted iterations
patients   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 8160 complete and 0 interrupted iterations
patients   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 9042 complete and 0 interrupted iterations
patients   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 9786 complete and 0 interrupted iterations
patients   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 10400 complete and 0 interrupted iterations
patients   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 11066 complete and 0 interrupted iterations
patients   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 11427 complete and 0 interrupted iterations
patients   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 11747 complete and 0 interrupted iterations
patients   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 12222 complete and 0 interrupted iterations
patients   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 12819 complete and 0 interrupted iterations
patients   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 13502 complete and 0 interrupted iterations
patients   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 14259 complete and 0 interrupted iterations
patients   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 15015 complete and 0 interrupted iterations
patients   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 15752 complete and 0 interrupted iterations
patients   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 16489 complete and 0 interrupted iterations
patients   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 17143 complete and 0 interrupted iterations
patients   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 17715 complete and 0 interrupted iterations
patients   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 18248 complete and 0 interrupted iterations
patients   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 18733 complete and 0 interrupted iterations
patients   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 19156 complete and 0 interrupted iterations
patients   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 19678 complete and 0 interrupted iterations
patients   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 20177 complete and 0 interrupted iterations
patients   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 21012 complete and 0 interrupted iterations
patients   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 21945 complete and 0 interrupted iterations
patients   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 22920 complete and 0 interrupted iterations
patients   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 23825 complete and 0 interrupted iterations
patients   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 24778 complete and 0 interrupted iterations
patients   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 25579 complete and 0 interrupted iterations
patients   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 26358 complete and 0 interrupted iterations
patients   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 27118 complete and 0 interrupted iterations
patients   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 27789 complete and 0 interrupted iterations
patients   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 28670 complete and 0 interrupted iterations
patients   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 29620 complete and 0 interrupted iterations
patients   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 30521 complete and 0 interrupted iterations
patients   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 31433 complete and 0 interrupted iterations
patients   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 32325 complete and 0 interrupted iterations
patients   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 33258 complete and 0 interrupted iterations
patients   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 34040 complete and 0 interrupted iterations
patients   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 34834 complete and 0 interrupted iterations
patients   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 35618 complete and 0 interrupted iterations
patients   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 36394 complete and 0 interrupted iterations
patients   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 37155 complete and 0 interrupted iterations
patients   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 37972 complete and 0 interrupted iterations
patients   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 38667 complete and 0 interrupted iterations
patients   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 39413 complete and 0 interrupted iterations
patients   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 40001 complete and 0 interrupted iterations
patients   [ 100% ] 10 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 40011   666.724989/s
    checks_succeeded...: 100.00% 40011 out of 40011
    checks_failed......: 0.00%   0 out of 40011

    ✓ created

    HTTP
    http_req_duration..............: avg=14.8ms  med=12.02ms p(90)=22.32ms p(95)=28.81ms p(99)=59.56ms max=470.45ms
      { expected_response:true }...: avg=14.8ms  med=12.02ms p(90)=22.32ms p(95)=28.81ms p(99)=59.56ms max=470.45ms
    http_req_failed................: 0.00% 0 out of 40011
    http_reqs......................: 40011 666.724989/s

    EXECUTION
    iteration_duration.............: avg=14.98ms med=12.19ms p(90)=22.51ms p(95)=29.03ms p(99)=59.77ms max=474.94ms
    iterations.....................: 40011 666.724989/s
    vus............................: 10    min=10         max=10
    vus_max........................: 10    min=10         max=10

    NETWORK
    data_received..................: 13 MB 216 kB/s
    data_sent......................: 20 MB 340 kB/s



running (1m00.0s), 00/10 VUs, 40011 complete and 0 interrupted iterations
patients ✓ [ 100% ] 10 VUs  1m0s